app/controllers/questions_controller.rb

SELECT "questions".* FROM "questions"  ORDER BY "questions"."created_at" DESC
---
  def index
    @questions = Question.order(created_at: :desc)

SELECT  "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "answers".* FROM "answers" WHERE "answers"."question_id" = $1  ORDER BY "answers"."created_at" DESC  [["question_id", 1]]
---
  def show
    @question = Question.find(params[:id])
    @answers = Answer.where(question_id: params[:id])

INSERT INTO "questions" ("title", "question_body", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"
---
  def create
    @question = Question.new(question_params)
    if @question.save

SELECT  "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT 1  [["id", 2]]
---
  def update
    @question = Question.find(params[:id])

SELECT  "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT 1  [["id", 3]]
SELECT "answers".* FROM "answers" WHERE "answers"."question_id" = '3'
DELETE FROM "questions" WHERE "questions"."id" = $1  [["id", 3]]
---
  def destroy
    @question = Question.find(params[:id])
    @answers = Answer.where(question_id: params[:id])
    if @question.destroy